/*
#############################################################################################
# Outlast2 (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: OLGame_structs.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct OLGame.OLTypes.DamageTypeParams
// 0x001D
struct FDamageTypeParams
{
	uint8_t                                            DamageType;                                    // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bBloodParticles : 1;                           // 0x0004 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bCameraShake : 1;                              // 0x0004 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bBlur : 1;                                     // 0x0004 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bSoundEffect : 1;                              // 0x0004 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bBladeDamage : 1;                              // 0x0004 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	uint32_t                                           bNonLethal : 1;                                // 0x0004 (0x0004) [0x0000000000000001] [0x00000020] (CPF_Edit)
	uint32_t                                           bForceBleeding : 1;                            // 0x0004 (0x0004) [0x0000000000000001] [0x00000040] (CPF_Edit)
	uint32_t                                           bNoBleeding : 1;                               // 0x0004 (0x0004) [0x0000000000000001] [0x00000080] (CPF_Edit)
	uint32_t                                           bShowBloodColumn : 1;                          // 0x0004 (0x0004) [0x0000000000000001] [0x00000100] (CPF_Edit)
	float                                              BloodColumnTime;                               // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ForcedDamageAngle;                             // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              CameraShakeDamageOverride;                     // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              SpeedPenaltyPctOnDamage;                       // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              SpeedPenaltyDuration;                          // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            DamagedFFWaveform;                             // 0x001C (0x0001) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLTypes.GameTime
// 0x000C
struct FGameTime
{
	int32_t                                            Hours;                                         // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            Minutes;                                       // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            Seconds;                                       // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLTypes.BlendSpaceNode
// 0x0010
struct FBlendSpaceNode
{
	struct FName                                       AnimName;                                      // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FVector2D                                   Coords;                                        // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLTypes.StruggleConfig
// 0x007C
struct FStruggleConfig
{
	struct FName                                       InitIdleAnimEnemy;                             // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       EntryAnimPlayer;                               // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       EntryAnimEnemy;                                // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       CycleAnimPlayer;                               // 0x0018 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       CycleAnimEnemy;                                // 0x0020 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       ExitAnimPlayer;                                // 0x0028 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       ExitAnimEnemy;                                 // 0x0030 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       KilledAnimPlayer;                              // 0x0038 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       KillAnimEnemy;                                 // 0x0040 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              EntryPlayerBlendInTime;                        // 0x0048 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ExitPlayerBlendOutTime;                        // 0x004C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              CycleTime;                                     // 0x0050 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bNoFail : 1;                                   // 0x0054 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	float                                              MinRate;                                       // 0x0058 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxRateStart;                                  // 0x005C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxRateEnd;                                    // 0x0060 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              SuccessPctForMinRate;                          // 0x0064 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              SuccessPctForMaxRate;                          // 0x0068 (0x0004) [0x0000000000000001] (CPF_Edit)    
	TArray<class UAnimSet*>                            HeroAnimSets;                                  // 0x006C (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct OLGame.OLPawn.GameplayParams
// 0x0040
struct FGameplayParams
{
	uint8_t                                            RMM;                                           // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            CameraMode;                                    // 0x0001 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bAllowSpringForMouse : 1;                      // 0x0004 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	float                                              MinYaw;                                        // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxYaw;                                        // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MinPitchWS;                                    // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxPitchWS;                                    // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MinPitchCS;                                    // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxPitchCS;                                    // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ViewLimitsApproachCoeff;                       // 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FOVOverride;                                   // 0x0024 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           DisableCollisions : 1;                         // 0x0028 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           IgnorePawnCollisions : 1;                      // 0x0028 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bEnablePawnRepulsion : 1;                      // 0x0028 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bSupportsCrouching : 1;                        // 0x0028 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bKeepsPhysics : 1;                             // 0x0028 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	float                                              CollisionHeight;                               // 0x002C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              CollisionRadius;                               // 0x0030 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            Physics;                                       // 0x0034 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bDisablePhysFalling : 1;                       // 0x0038 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bNoZVelocityClear : 1;                         // 0x0038 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           BothHandsNeeded : 1;                           // 0x0038 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	float                                              MaxStepHeight;                                 // 0x003C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLPawn.SpecialMoveParameters
// 0x0078
struct FSpecialMoveParameters
{
	struct FGameplayParams                             GP;                                            // 0x0000 (0x0040) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            NextLocomotionMode;                            // 0x0040 (0x0001) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       AnimName;                                      // 0x0044 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              AnimPlayRate;                                  // 0x004C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bNoAnim : 1;                                   // 0x0050 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bUpperBodyAnim : 1;                            // 0x0050 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	float                                              AnimBlendInTime;                               // 0x0054 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AnimBlendOutTime;                              // 0x0058 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bCancelMoveOnInterruption : 1;                 // 0x005C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bExitOnBlendOut : 1;                           // 0x005C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bPlayAnimWhenPositioned : 1;                   // 0x005C (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bTargettedYawSmoothing : 1;                    // 0x005C (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bTargettedPitchSmoothing : 1;                  // 0x005C (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	uint32_t                                           bAlwaysInterruptible : 1;                      // 0x005C (0x0004) [0x0000000000000001] [0x00000020] (CPF_Edit)
	uint32_t                                           bInterruptibleAfterTrigger : 1;                // 0x005C (0x0004) [0x0000000000000001] [0x00000040] (CPF_Edit)
	uint32_t                                           bCollisionChangeOnTrigger : 1;                 // 0x005C (0x0004) [0x0000000000000001] [0x00000080] (CPF_Edit)
	uint32_t                                           PlayerInputEnabled : 1;                        // 0x005C (0x0004) [0x0000000000000001] [0x00000100] (CPF_Edit)
	uint32_t                                           KeepLocomotionMode : 1;                        // 0x005C (0x0004) [0x0000000000000001] [0x00000200] (CPF_Edit)
	uint32_t                                           AdjustPosition : 1;                            // 0x005C (0x0004) [0x0000000000000001] [0x00000400] (CPF_Edit)
	uint32_t                                           AdjustOrientation : 1;                         // 0x005C (0x0004) [0x0000000000000001] [0x00000800] (CPF_Edit)
	uint32_t                                           UseAnimTimeForPositionAdjustment : 1;          // 0x005C (0x0004) [0x0000000000000001] [0x00001000] (CPF_Edit)
	uint32_t                                           bUsePawnVelocityForPositionning : 1;           // 0x005C (0x0004) [0x0000000000000001] [0x00002000] (CPF_Edit)
	float                                              PositionningLinearVelocity;                    // 0x0060 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              PositionningCrouchedLinearVelocity;            // 0x0064 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              PositionningCrawledLinearVelocity;             // 0x0068 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              PositionningAngularVelocity;                   // 0x006C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StaminaConsumption;                            // 0x0070 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bUseDarkLight : 1;                             // 0x0074 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bNoCamcorderTransition : 1;                    // 0x0074 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
};

// ScriptStruct OLGame.OLPawn.AdjustPositionData
// 0x0038
struct FAdjustPositionData
{
	uint32_t                                           Active : 1;                                    // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           Done : 1;                                      // 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FVector                                     PositionError;                                 // 0x0004 (0x000C) [0x0000000000000000]               
	float                                              HeadingError;                                  // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                            TargetType;                                    // 0x0014 (0x0001) [0x0000000000000000]               
	struct FVector                                     OriginalPosition;                              // 0x0018 (0x000C) [0x0000000000000000]               
	struct FRotator                                    OriginalRotation;                              // 0x0024 (0x000C) [0x0000000000000000]               
	float                                              CorrectionTime;                                // 0x0030 (0x0004) [0x0000000000000000]               
	float                                              ElapsedTime;                                   // 0x0034 (0x0004) [0x0000000000000000]               
};

// ScriptStruct OLGame.OLPawn.ProceduralAnimData
// 0x0049
struct FProceduralAnimData
{
	struct FVector                                     PositionDelta;                                 // 0x0000 (0x000C) [0x0000000000000000]               
	float                                              HeadingDelta;                                  // 0x000C (0x0004) [0x0000000000000000]               
	uint8_t                                            InterpType;                                    // 0x0010 (0x0001) [0x0000000000000000]               
	float                                              ConstantSpeedContrib;                          // 0x0014 (0x0004) [0x0000000000000000]               
	float                                              DelayTimeLeft;                                 // 0x0018 (0x0004) [0x0000000000000000]               
	float                                              TotalTime;                                     // 0x001C (0x0004) [0x0000000000000000]               
	float                                              ElapsedTime;                                   // 0x0020 (0x0004) [0x0000000000000000]               
	uint32_t                                           bWaitForNotify : 1;                            // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bRecomputeDataAfterNotify : 1;                 // 0x0024 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FVector                                     RecomputeDesiredPosition;                      // 0x0028 (0x000C) [0x0000000000000000]               
	struct FRotator                                    RecomputeDesiredOrientation;                   // 0x0034 (0x000C) [0x0000000000000000]               
	uint32_t                                           bIndependentRotationControl : 1;               // 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              IndependentRotationDuration;                   // 0x0044 (0x0004) [0x0000000000000000]               
	uint8_t                                            RotationInterpType;                            // 0x0048 (0x0001) [0x0000000000000000]               
};

// ScriptStruct OLGame.OLPawn.MovementBlockedData
// 0x001C
struct FMovementBlockedData
{
	struct FVector                                     Location;                                      // 0x0000 (0x000C) [0x0000000000000000]               
	struct FVector                                     Direction;                                     // 0x000C (0x000C) [0x0000000000000000]               
	float                                              TimeStamp;                                     // 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct OLGame.OLPawn.DelayedEventInfo
// 0x0014
struct FDelayedEventInfo
{
	class UAkEvent*                                    SoundEvent;                                    // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              DueTime;                                       // 0x0008 (0x0004) [0x0000000000000000]               
	struct FName                                       BoneName;                                      // 0x000C (0x0008) [0x0000000000000000]               
};

// ScriptStruct OLGame.OLAIAnimConfig.LocomotionAnimConfig
// 0x0128
struct FLocomotionAnimConfig
{
	float                                              LocoMinSpeed;                                  // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              LocoMedSpeed;                                  // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              LocoMaxSpeed;                                  // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              LocoRunSpeed;                                  // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BwdMinSpeed;                                   // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BwdMedSpeed;                                   // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BwdMaxSpeed;                                   // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BwdRunSpeed;                                   // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ArmedMinSpeed;                                 // 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ArmedMedSpeed;                                 // 0x0024 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ArmedMaxSpeed;                                 // 0x0028 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ArmedRunSpeed;                                 // 0x002C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ArmedBwdMinSpeed;                              // 0x0030 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ArmedBwdMedSpeed;                              // 0x0034 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ArmedBwdMaxSpeed;                              // 0x0038 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ArmedBwdRunSpeed;                              // 0x003C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertMinSpeed;                                 // 0x0040 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertMedSpeed;                                 // 0x0044 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertMaxSpeed;                                 // 0x0048 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertRunSpeed;                                 // 0x004C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertBwdMinSpeed;                              // 0x0050 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertBwdMedSpeed;                              // 0x0054 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertBwdMaxSpeed;                              // 0x0058 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertBwdRunSpeed;                              // 0x005C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertArmedMinSpeed;                            // 0x0060 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertArmedMedSpeed;                            // 0x0064 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertArmedMaxSpeed;                            // 0x0068 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertArmedRunSpeed;                            // 0x006C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertArmedBwdMinSpeed;                         // 0x0070 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertArmedBwdMedSpeed;                         // 0x0074 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertArmedBwdMaxSpeed;                         // 0x0078 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AlertArmedBwdRunSpeed;                         // 0x007C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StartUnawareSlowSpeed;                         // 0x0080 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StartUnawareFastSpeed;                         // 0x0084 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StartAlertSlowSpeed;                           // 0x0088 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StartAlertFastSpeed;                           // 0x008C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StopUnawareSlowSpeed;                          // 0x0090 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StopUnawareFastSpeed;                          // 0x0094 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StopAlertSlowSpeed;                            // 0x0098 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StopAlertFastSpeed;                            // 0x009C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StartSpeedThreshold;                           // 0x00A0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StopSpeedThreshold;                            // 0x00A4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ImmediateStopSpeedThreshold;                   // 0x00A8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              TurnMinMovingContribUnder90;                   // 0x00AC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              TurnMinMovingContribOver90;                    // 0x00B0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              TurnBlendTimePct;                              // 0x00B4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareSlowFwd;                     // 0x00B8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertSlowFwd;                       // 0x00BC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareSlow90L;                     // 0x00C0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertSlow90L;                       // 0x00C4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareSlow90R;                     // 0x00C8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertSlow90R;                       // 0x00CC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareSlow180L;                    // 0x00D0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertSlow180L;                      // 0x00D4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareSlow180R;                    // 0x00D8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertSlow180R;                      // 0x00DC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareFastFwd;                     // 0x00E0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertFastFwd;                       // 0x00E4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareFast90L;                     // 0x00E8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertFast90L;                       // 0x00EC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareFast90R;                     // 0x00F0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertFast90R;                       // 0x00F4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareFast180L;                    // 0x00F8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertFast180L;                      // 0x00FC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopUnawareFast180R;                    // 0x0100 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DistForStopAlertFast180R;                      // 0x0104 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StairsEntryDistBottomL;                        // 0x0108 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StairsEntryDistBottomR;                        // 0x010C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StairsEntryDistBottomRunL;                     // 0x0110 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StairsEntryDistBottomRunR;                     // 0x0114 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StairsEntryDistTopL;                           // 0x0118 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StairsEntryDistTopR;                           // 0x011C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StairsEntryDistTopRunL;                        // 0x0120 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StairsEntryDistTopRunR;                        // 0x0124 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLDifficultyConfig.FloatByDifficulty
// 0x0034
struct FFloatByDifficulty
{
	float                                              DefaultValue;                                  // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_EasyValue : 1;                       // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              EasyValue;                                     // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_NormalValue : 1;                     // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              NormalValue;                                   // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_NormalPlusValue : 1;                 // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              NormalPlusValue;                               // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_HardValue : 1;                       // 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              HardValue;                                     // 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_HardPlusValue : 1;                   // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              HardPlusValue;                                 // 0x0028 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_NightmareValue : 1;                  // 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              NightmareValue;                                // 0x0030 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLAIConfig.ArrowParameters
// 0x0080
struct FArrowParameters
{
	uint32_t                                           bOverride_bEnableForNormalAttack : 1;          // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bEnableForNormalAttack : 1;                    // 0x0000 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_bAlwaysAiming : 1;                   // 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bAlwaysAiming : 1;                             // 0x0000 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bOverride_bShootWheneverPossible : 1;          // 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bShootWheneverPossible : 1;                    // 0x0000 (0x0004) [0x0000000000000001] [0x00000020] (CPF_Edit)
	uint32_t                                           bOverride_Speed : 1;                           // 0x0000 (0x0004) [0x0000000000000000] [0x00000040] 
	float                                              Speed;                                         // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_MinAttackDistance : 1;               // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MinAttackDistance;                             // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_MaxAttackDistance : 1;               // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MaxAttackDistance;                             // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_MinRepeatDelay : 1;                  // 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MinRepeatDelay;                                // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_bFollowTarget : 1;                   // 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bFollowTarget : 1;                             // 0x0020 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_MinDistForFollowTarget : 1;          // 0x0020 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              MinDistForFollowTarget;                        // 0x0024 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_bFollowTargetOnlyWithLoS : 1;        // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bFollowTargetOnlyWithLoS : 1;                  // 0x0028 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_VelocityPredictionFactor : 1;        // 0x0028 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              VelocityPredictionFactor;                      // 0x002C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_MaxInaccuracy : 1;                   // 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MaxInaccuracy;                                 // 0x0034 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_HitDamage : 1;                       // 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          HitDamage;                                     // 0x003C (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_bArrowsOnFire : 1;                   // 0x0070 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bArrowsOnFire : 1;                             // 0x0070 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_FireStopDuration : 1;                // 0x0070 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              FireStopDuration;                              // 0x0074 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_bNoPlayerHit : 1;                    // 0x0078 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bNoPlayerHit : 1;                              // 0x0078 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_MinDistToTargetToDisableCollisions : 1;// 0x0078 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              MinDistToTargetToDisableCollisions;            // 0x007C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLAIConfig.SpeedConfig
// 0x0328
struct FSpeedConfig
{
	uint32_t                                           bOverride_BaseSpeedByDifficulty : 1;           // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          BaseSpeedByDifficulty;                         // 0x0004 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_InvestigationSpeedByDifficulty : 1;  // 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          InvestigationSpeedByDifficulty;                // 0x003C (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_ChaseSpeedByDifficulty : 1;          // 0x0070 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          ChaseSpeedByDifficulty;                        // 0x0074 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CrawlSpeedByDifficulty : 1;          // 0x00A8 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          CrawlSpeedByDifficulty;                        // 0x00AC (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CrouchSpeedByDifficulty : 1;         // 0x00E0 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          CrouchSpeedByDifficulty;                       // 0x00E4 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_BeamSpeedByDifficulty : 1;           // 0x0118 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          BeamSpeedByDifficulty;                         // 0x011C (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_BushChaseSpeedByDifficulty : 1;      // 0x0150 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          BushChaseSpeedByDifficulty;                    // 0x0154 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_WaterSpeedMultiplier : 1;            // 0x0188 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              WaterSpeedMultiplier;                          // 0x018C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_BehaviorAccelRate : 1;               // 0x0190 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              BehaviorAccelRate;                             // 0x0194 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_BehaviorDecelRate : 1;               // 0x0198 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              BehaviorDecelRate;                             // 0x019C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_DarknessFactorByDifficulty : 1;      // 0x01A0 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          DarknessFactorByDifficulty;                    // 0x01A4 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_AttackMercyFactor : 1;               // 0x01D8 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          AttackMercyFactor;                             // 0x01DC (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_AttackMercyDuration : 1;             // 0x0210 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              AttackMercyDuration;                           // 0x0214 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_ChaseNoVisibilityFactorByDifficulty : 1;// 0x0218 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          ChaseNoVisibilityFactorByDifficulty;           // 0x021C (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_bNoVisibleRubberBandingSlowDown : 1; // 0x0250 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bNoVisibleRubberBandingSlowDown : 1;           // 0x0250 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_bRubberBandingRequiresPlayerRun : 1; // 0x0250 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bRubberBandingRequiresPlayerRun : 1;           // 0x0250 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bOverride_RubberBandingDelay : 1;              // 0x0250 (0x0004) [0x0000000000000000] [0x00000010] 
	float                                              RubberBandingDelay;                            // 0x0254 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_RubberBandingMinDist : 1;            // 0x0258 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              RubberBandingMinDist;                          // 0x025C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_RubberBandingMaxDist : 1;            // 0x0260 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              RubberBandingMaxDist;                          // 0x0264 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_RubberBandingFactorMinDistByDifficulty : 1;// 0x0268 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          RubberBandingFactorMinDistByDifficulty;        // 0x026C (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_RubberBandingFactorMaxDistByDifficulty : 1;// 0x02A0 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          RubberBandingFactorMaxDistByDifficulty;        // 0x02A4 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_bEnableCrouchCrawlRubberBanding : 1; // 0x02D8 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bEnableCrouchCrawlRubberBanding : 1;           // 0x02D8 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_CrouchCrawlRubberBandingMinDist : 1; // 0x02D8 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              CrouchCrawlRubberBandingMinDist;               // 0x02DC (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CrouchCrawlRubberBandingMaxDist : 1; // 0x02E0 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CrouchCrawlRubberBandingMaxDist;               // 0x02E4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CrouchCrawlRubberBandingFactorMinDist : 1;// 0x02E8 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CrouchCrawlRubberBandingFactorMinDist;         // 0x02EC (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CrouchCrawlRubberBandingFactorMaxDist : 1;// 0x02F0 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CrouchCrawlRubberBandingFactorMaxDist;         // 0x02F4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_SightlessChaseSlowdownDuration : 1;  // 0x02F8 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              SightlessChaseSlowdownDuration;                // 0x02FC (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_bExponentialAccel : 1;               // 0x0300 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bExponentialAccel : 1;                         // 0x0300 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_ExponentialAccelStartDelay : 1;      // 0x0300 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              ExponentialAccelStartDelay;                    // 0x0304 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_ExponentialAccelDuration : 1;        // 0x0308 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ExponentialAccelDuration;                      // 0x030C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_ExponentialAccelPower : 1;           // 0x0310 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ExponentialAccelPower;                         // 0x0314 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_bNoAdjustmentForSlopes : 1;          // 0x0318 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bNoAdjustmentForSlopes : 1;                    // 0x0318 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_MaxSpeedPenaltyForUpSlope : 1;       // 0x0318 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              MaxSpeedPenaltyForUpSlope;                     // 0x031C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_MaxSpeedGainForDownSlope : 1;        // 0x0320 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MaxSpeedGainForDownSlope;                      // 0x0324 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLDifficultyConfig.IntByDifficulty
// 0x0034
struct FIntByDifficulty
{
	int32_t                                            DefaultValue;                                  // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_EasyValue : 1;                       // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            EasyValue;                                     // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_NormalValue : 1;                     // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            NormalValue;                                   // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_NormalPlusValue : 1;                 // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            NormalPlusValue;                               // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_HardValue : 1;                       // 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            HardValue;                                     // 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_HardPlusValue : 1;                   // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            HardPlusValue;                                 // 0x0028 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_NightmareValue : 1;                  // 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            NightmareValue;                                // 0x0030 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLAIConfig.VisionCone
// 0x00E0
struct FVisionCone
{
	uint32_t                                           bOverride_DistanceByDifficulty : 1;            // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          DistanceByDifficulty;                          // 0x0004 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_PeekingDistanceByDifficulty : 1;     // 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          PeekingDistanceByDifficulty;                   // 0x003C (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_HorizontalAngleByDifficulty : 1;     // 0x0070 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          HorizontalAngleByDifficulty;                   // 0x0074 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_VerticalAngleByDifficulty : 1;       // 0x00A8 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          VerticalAngleByDifficulty;                     // 0x00AC (0x0034) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLAIConfig.VisionParameters
// 0x0228
struct FVisionParameters
{
	uint32_t                                           bOverride_LoseTargetTimeByDifficulty : 1;      // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FFloatByDifficulty                          LoseTargetTimeByDifficulty;                    // 0x0004 (0x0034) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CloseDistanceStand : 1;              // 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CloseDistanceStand;                            // 0x003C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CloseDistanceCrouch : 1;             // 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CloseDistanceCrouch;                           // 0x0044 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CloseDistanceCrawl : 1;              // 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CloseDistanceCrawl;                            // 0x004C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CrouchMultiplier : 1;                // 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CrouchMultiplier;                              // 0x0054 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CrawlMultiplier : 1;                 // 0x0058 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CrawlMultiplier;                               // 0x005C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CloseFacingDistance : 1;             // 0x0060 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CloseFacingDistance;                           // 0x0064 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVisionCone                                 NarrowCone;                                    // 0x0068 (0x00E0) [0x0000000000000001] (CPF_Edit)    
	struct FVisionCone                                 WideCone;                                      // 0x0148 (0x00E0) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLAIConfig.FaceOffParameters
// 0x0030
struct FFaceOffParameters
{
	uint32_t                                           bOverride_bEnabled : 1;                        // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bEnabled : 1;                                  // 0x0000 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_MinRangeForEnter : 1;                // 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              MinRangeForEnter;                              // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_MaxRangeForEnter : 1;                // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MaxRangeForEnter;                              // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_MinRangeForExit : 1;                 // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MinRangeForExit;                               // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_MaxRangeForExit : 1;                 // 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              MaxRangeForExit;                               // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_EnterDelay : 1;                      // 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              EnterDelay;                                    // 0x0024 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_CancelDelay : 1;                     // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              CancelDelay;                                   // 0x002C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct OLGame.OLAIConfig.DeathGripParameters
// 0x00D0
struct FDeathGripParameters
{
	uint32_t                                           bOverride_bEnabled : 1;                        // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bEnabled : 1;                                  // 0x0000 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bOverride_bAlwaysQTE : 1;                      // 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bAlwaysQTE : 1;                                // 0x0000 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bOverride_bAlwaysShake : 1;                    // 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bAlwaysShake : 1;                              // 0x0000 (0x0004) [0x0000000000000001] [0x00000020] (CPF_Edit)
	uint32_t                                           bOverride_bCanBeJoinedForMultiKill : 1;        // 0x0000 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           bCanBeJoinedForMultiKill : 1;                  // 0x0000 (0x0004) [0x0000000000000001] [0x00000080] (CPF_Edit)
	uint32_t                                           bOverride_bCanJoinForMultiKill : 1;            // 0x0000 (0x0004) [0x0000000000000000] [0x00000100] 
