/*
#############################################################################################
# Outlast2 (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.2
# ========================================================================================= #
# File: OLGame_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function OLGame.OLAITrigger.Touch
// [0x00020802] 
struct AOLAITrigger_eventTouch_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitNormal;                                        		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLAITrigger.NativeOnTouch
// [0x00020400] 
struct AOLAITrigger_execNativeOnTouch_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLAITrigger.PostBeginPlay
// [0x00020902] 
struct AOLAITrigger_eventPostBeginPlay_Params
{
	// class USpriteComponent*                            ASpriteComp;                                      		// 0x0000 (0x0008) [0x0000000004000000] (CPF_EditInline)
};

// Function OLGame.OLBasementWindow.OnToggle
// [0x00020102] 
struct AOLBasementWindow_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLBashableObject.OnToggle
// [0x00020002] 
struct AOLBashableObject_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLBlockingObject.OnToggle
// [0x00020002] 
struct AOLBlockingObject_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLBlockingObject.OnDisable
// [0x00020400] 
struct AOLBlockingObject_execOnDisable_Params
{
};

// Function OLGame.OLBlockingObject.OnEnable
// [0x00020400] 
struct AOLBlockingObject_execOnEnable_Params
{
};

// Function OLGame.OLCamcorderFilesHud.SetPCInputLabel
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetPCInputLabel_Params
{
	class FString                                      navigationLabelUp;                                		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      navigationLabelLeft;                              		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      navigationLabelDown;                              		// 0x0020 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      navigationLabelRight;                             		// 0x0030 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      nextLabel;                                        		// 0x0040 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      previousLabel;                                    		// 0x0050 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      backLabel;                                        		// 0x0060 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      displayLabel;                                     		// 0x0070 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      playLabel;                                        		// 0x0080 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      selectLabelText;                                  		// 0x0090 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCamcorderFilesHud.SetPCInputLabelFunction
// [0x00020002] 
struct UOLCamcorderFilesHud_execSetPCInputLabelFunction_Params
{
	class FString                                      navigationLabelUp;                                		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      navigationLabelLeft;                              		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      navigationLabelDown;                              		// 0x0020 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      navigationLabelRight;                             		// 0x0030 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      nextLabel;                                        		// 0x0040 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      previousLabel;                                    		// 0x0050 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      backLabel;                                        		// 0x0060 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      displayLabel;                                     		// 0x0070 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      playLabel;                                        		// 0x0080 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      selectLabelText;                                  		// 0x0090 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCamcorderFilesHud.selectConsole
// [0x00020002] 
struct UOLCamcorderFilesHud_execselectConsole_Params
{
	class FString                                      Console;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCamcorderFilesHud.UsingPC
// [0x00020802] 
struct UOLCamcorderFilesHud_eventUsingPC_Params
{
};

// Function OLGame.OLCamcorderFilesHud.UsingXboxOne
// [0x00020802] 
struct UOLCamcorderFilesHud_eventUsingXboxOne_Params
{
};

// Function OLGame.OLCamcorderFilesHud.UsingPS4
// [0x00020802] 
struct UOLCamcorderFilesHud_eventUsingPS4_Params
{
};

// Function OLGame.OLCamcorderFilesHud.SetSouthPaw
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetSouthPaw_Params
{
	uint32_t                                           bSouthPaw : 1;                                    		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLCamcorderFilesHud.SetLocalizedText
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetLocalizedText_Params
{
	class FString                                      zoomLabel;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      navigationLabel;                                  		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      cleanTextLabel;                                   		// 0x0020 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      selectLabel;                                      		// 0x0030 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      backLabel;                                        		// 0x0040 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      previousLabel;                                    		// 0x0050 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      nextLabel;                                        		// 0x0060 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      playLabel;                                        		// 0x0070 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      pauseLabel;                                       		// 0x0080 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      moveImage;                                        		// 0x0090 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCamcorderFilesHud.PopulateFolderList
// [0x00024400] 
struct UOLCamcorderFilesHud_execPopulateFolderList_Params
{
	uint32_t                                           bRefreshOnly : 1;                                 		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLCamcorderFilesHud.WidgetInitialized
// [0x00020802] 
struct UOLCamcorderFilesHud_eventWidgetInitialized_Params
{
	struct FName                                       WidgetName;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       WidgetPath;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UGFxObject*                                  Widget;                                           		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// uint32_t                                           bWasHandled : 1;                                  		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function OLGame.OLCamcorderFilesHud.HideImageNavigateLabel
// [0x00020802] 
struct UOLCamcorderFilesHud_eventHideImageNavigateLabel_Params
{
};

// Function OLGame.OLCamcorderFilesHud.ShowImageNavigateLabel
// [0x00020802] 
struct UOLCamcorderFilesHud_eventShowImageNavigateLabel_Params
{
};

// Function OLGame.OLCamcorderFilesHud.Pause
// [0x00020802] 
struct UOLCamcorderFilesHud_eventPause_Params
{
};

// Function OLGame.OLCamcorderFilesHud.TogglePlayPause
// [0x00020802] 
struct UOLCamcorderFilesHud_eventTogglePlayPause_Params
{
};

// Function OLGame.OLCamcorderFilesHud.InputTypeChanged
// [0x00020802] 
struct UOLCamcorderFilesHud_eventInputTypeChanged_Params
{
};

// Function OLGame.OLCamcorderFilesHud.NativeInputTypeChanged
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativeInputTypeChanged_Params
{
};

// Function OLGame.OLCamcorderFilesHud.NativePlaySound
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativePlaySound_Params
{
	class UAkEvent*                                    SndEvent;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCamcorderFilesHud.OnStop
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnStop_Params
{
};

// Function OLGame.OLCamcorderFilesHud.NativeOnStop
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativeOnStop_Params
{
};

// Function OLGame.OLCamcorderFilesHud.NativeFullStop
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativeFullStop_Params
{
};

// Function OLGame.OLCamcorderFilesHud.OnPlay
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnPlay_Params
{
};

// Function OLGame.OLCamcorderFilesHud.NativeOnPlay
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativeOnPlay_Params
{
};

// Function OLGame.OLCamcorderFilesHud.OnDisplayChange
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnDisplayChange_Params
{
};

// Function OLGame.OLCamcorderFilesHud.NativeOnDisplayChange
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativeOnDisplayChange_Params
{
};

// Function OLGame.OLCamcorderFilesHud.OnMove
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnMove_Params
{
};

// Function OLGame.OLCamcorderFilesHud.OnSelect
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnSelect_Params
{
};

// Function OLGame.OLCamcorderFilesHud.OnBack
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnBack_Params
{
};

// Function OLGame.OLCamcorderFilesHud.OnBackOnRootMenu
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnBackOnRootMenu_Params
{
};

// Function OLGame.OLCamcorderFilesHud.NativeOnBackOnRootMenu
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativeOnBackOnRootMenu_Params
{
};

// Function OLGame.OLCamcorderFilesHud.OnScrollToIndexChange
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnScrollToIndexChange_Params
{
	int32_t                                            ListIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            StartIndex;                                       		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            endIndex;                                         		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCamcorderFilesHud.NativeOnScrollToIndexChange
// [0x00024400] 
struct UOLCamcorderFilesHud_execNativeOnScrollToIndexChange_Params
{
	int32_t                                            ListIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            StartIndex;                                       		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            endIndex;                                         		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bForce : 1;                                       		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLCamcorderFilesHud.OnFullScaleImageChanged
// [0x00020002] 
struct UOLCamcorderFilesHud_execOnFullScaleImageChanged_Params
{
	uint32_t                                           bInView : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	class FString                                      photoName;                                        		// 0x0004 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCamcorderFilesHud.NativeOnFullScaleImageChanged
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativeOnFullScaleImageChanged_Params
{
	uint32_t                                           bInView : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	class FString                                      photoName;                                        		// 0x0004 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCamcorderFilesHud.NativeQuickOpen
// [0x00020400] 
struct UOLCamcorderFilesHud_execNativeQuickOpen_Params
{
};

// Function OLGame.OLCamcorderFilesHud.SetLargePhotoURL
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetLargePhotoURL_Params
{
	int32_t                                            folderIndex;                                      		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            imageIndex;                                       		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      largePhotoURL;                                    		// 0x0008 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLCamcorderFilesHud.SelectRecording
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSelectRecording_Params
{
	int32_t                                            folderIndex;                                      		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            imageIndex;                                       		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCamcorderFilesHud.SetAllowSingleFolder
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetAllowSingleFolder_Params
{
	uint32_t                                           bAllowSingleFolder : 1;                           		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.SetDisplayLabel
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetDisplayLabel_Params
{
	class FString                                      Label;                                            		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.SetVisible
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetVisible_Params
{
	uint32_t                                           bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLCamcorderFilesHud.FlagRecordingAsRead
// [0x00020802] 
struct UOLCamcorderFilesHud_eventFlagRecordingAsRead_Params
{
	int32_t                                            folderIndex;                                      		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            recordingIndex;                                   		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCamcorderFilesHud.DisplayChange
// [0x00020802] 
struct UOLCamcorderFilesHud_eventDisplayChange_Params
{
};

// Function OLGame.OLCamcorderFilesHud.RefreshData
// [0x00020802] 
struct UOLCamcorderFilesHud_eventRefreshData_Params
{
};

// Function OLGame.OLCamcorderFilesHud.SetListFocusIndex
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetListFocusIndex_Params
{
	int32_t                                            indexA;                                           		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            indexB;                                           		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            indexC;                                           		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            indexD;                                           		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            indexE;                                           		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            indexF;                                           		// 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.SetLargeImageSize
// [0x00020802] 
struct UOLCamcorderFilesHud_eventSetLargeImageSize_Params
{
	float                                              SizeX;                                            		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              SizeY;                                            		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PosX;                                             		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PosY;                                             		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.DisallowInputChangeFocus
// [0x00020802] 
struct UOLCamcorderFilesHud_eventDisallowInputChangeFocus_Params
{
};

// Function OLGame.OLCamcorderFilesHud.AllowInputChangeFocus
// [0x00020802] 
struct UOLCamcorderFilesHud_eventAllowInputChangeFocus_Params
{
};

// Function OLGame.OLCamcorderFilesHud.PauseVideo
// [0x00020802] 
struct UOLCamcorderFilesHud_eventPauseVideo_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.ConfigUI
// [0x00020802] 
struct UOLCamcorderFilesHud_eventConfigUI_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.back
// [0x00020802] 
struct UOLCamcorderFilesHud_eventback_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.BackToMainMenu
// [0x00020802] 
struct UOLCamcorderFilesHud_eventBackToMainMenu_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.Next
// [0x00020802] 
struct UOLCamcorderFilesHud_eventNext_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.Previous
// [0x00020802] 
struct UOLCamcorderFilesHud_eventPrevious_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.RefreshLargeImage
// [0x00020802] 
struct UOLCamcorderFilesHud_eventRefreshLargeImage_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderFilesHud.FilterButtonInput
// [0x00020802] 
struct UOLCamcorderFilesHud_eventFilterButtonInput_Params
{
	int32_t                                            ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       ButtonName;                                       		// 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            InputEvent;                                       		// 0x000C (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderHud.UpdateRecordingTime
// [0x00020002] 
struct UOLCamcorderHud_execUpdateRecordingTime_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                            TotalSeconds;                                     		// 0x0004 (0x0004) [0x0000000000000000]               
	// class FString                                      Hours;                                            		// 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      Minutes;                                          		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      Seconds;                                          		// 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      HundredthsOfASecond;                              		// 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                      DisplayedTime;                                    		// 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// class AOLPlayerController*                         OLPC;                                             		// 0x0058 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCamcorderHud.WidgetInitialized
// [0x00020802] 
struct UOLCamcorderHud_eventWidgetInitialized_Params
{
	struct FName                                       WidgetName;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       WidgetPath;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UGFxObject*                                  Widget;                                           		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCamcorderHud.HandleUnpaused
// [0x00020802] 
struct UOLCamcorderHud_eventHandleUnpaused_Params
{
};

// Function OLGame.OLCamcorderHud.HandlePaused
// [0x00020802] 
struct UOLCamcorderHud_eventHandlePaused_Params
{
};

// Function OLGame.OLCamcorderHud.SetVisible
// [0x00020802] 
struct UOLCamcorderHud_eventSetVisible_Params
{
	uint32_t                                           bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLCameraActor.GetCameraView
// [0x00420102] 
struct AOLCameraActor_execGetCameraView_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTPOV                                       OutPOV;                                           		// 0x0004 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function OLGame.OLCameraActor.NativeGetCameraView
// [0x00420400] 
struct AOLCameraActor_execNativeGetCameraView_Params
{
	struct FTPOV                                       OutPOV;                                           		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function OLGame.OLPlayerController.UnlockAchievement
// [0x00020802] 
struct AOLPlayerController_eventUnlockAchievement_Params
{
	uint8_t                                            achievement;                                      		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                            ControllerId;                                     		// 0x0004 (0x0004) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.NotifyDifficultyChanged
// [0x00020002] 
struct AOLPlayerController_execNotifyDifficultyChanged_Params
{
	// class AOLBot*                                      Bot;                                              		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.UpdateDifficultyBasedValues
// [0x00020002] 
struct AOLPlayerController_execUpdateDifficultyBasedValues_Params
{
	// class AOLGame*                                     TheGame;                                          		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.CheckForProfileUpdate
// [0x00020802] 
struct AOLPlayerController_eventCheckForProfileUpdate_Params
{
};

// Function OLGame.OLPlayerController.UpdateLocalCacheOfProfileSettings
// [0x00020802] 
struct AOLPlayerController_eventUpdateLocalCacheOfProfileSettings_Params
{
	class UOLProfileSettings*                          EffectiveProfileSettings;                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// float                                              FloatValue;                                       		// 0x0008 (0x0004) [0x0000000000000000]               
	// int32_t                                            IntValue;                                         		// 0x000C (0x0004) [0x0000000000000000]               
	// class UOLWinEngine*                                WinEngine;                                        		// 0x0010 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.ClientSaveAllPlayerData
// [0xFFFF0000010241C2] 
struct AOLPlayerController_execClientSaveAllPlayerData_Params
{
	uint32_t                                           bShouldForce : 1;                                 		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bSkipCacheUpdate : 1;                             		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	// class ULocalPlayer*                                LP;                                               		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.OnProfileWriteComplete
// [0x00020002] 
struct AOLPlayerController_execOnProfileWriteComplete_Params
{
	uint8_t                                            LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bWasSuccessful : 1;                               		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.ClearSaveProfileDelegate
// [0x00020002] 
struct AOLPlayerController_execClearSaveProfileDelegate_Params
{
	int32_t                                            ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             WriteProfileSettingsCompleteDelegate;             		// 0x0004 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	// class UOnlinePlayerInterface*                      PlayerInt;                                        		// 0x0014 (0x0010) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.ResetProfile
// [0x00020802] 
struct AOLPlayerController_eventResetProfile_Params
{
};

// Function OLGame.OLPlayerController.SaveProfile
// [0x00020802] 
struct AOLPlayerController_eventSaveProfile_Params
{
	// int32_t                                            ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.OnControllerChanged
// [0x00020002] 
struct AOLPlayerController_execOnControllerChanged_Params
{
	int32_t                                            ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bIsConnected : 1;                                 		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.NativeOnControllerChanged
// [0x00020400] 
struct AOLPlayerController_execNativeOnControllerChanged_Params
{
	int32_t                                            ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bIsConnected : 1;                                 		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.UnregisterPlayerDataStores
// [0x00020102] 
struct AOLPlayerController_execUnregisterPlayerDataStores_Params
{
	// class ULocalPlayer*                                LP;                                               		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.RegisterCustomPlayerDataStores
// [0x00080102] 
struct AOLPlayerController_execRegisterCustomPlayerDataStores_Params
{
	// class ULocalPlayer*                                LP;                                               		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.CheatGiveAllCollectibles
// [0x00020400] 
struct AOLPlayerController_execCheatGiveAllCollectibles_Params
{
};

// Function OLGame.OLPlayerController.ShippingCheat_GiveAllCheckpoints
// [0x00020400] 
struct AOLPlayerController_execShippingCheat_GiveAllCheckpoints_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.QueueClearWorldState
// [0x00020002] 
struct AOLPlayerController_execQueueClearWorldState_Params
{
};

// Function OLGame.OLPlayerController.ClearSavedStates
// [0x00020400] 
struct AOLPlayerController_execClearSavedStates_Params
{
};

// Function OLGame.OLPlayerController.ClearAllProgress
// [0x00020400] 
struct AOLPlayerController_execClearAllProgress_Params
{
};

// Function OLGame.OLPlayerController.SaveBeforeQuitting
// [0x00020400] 
struct AOLPlayerController_execSaveBeforeQuitting_Params
{
};

// Function OLGame.OLPlayerController.ClientCommitMapChangeNoOverlay
// [0xFFFF0000010209C2] 
struct AOLPlayerController_eventClientCommitMapChangeNoOverlay_Params
{
};

// Function OLGame.OLPlayerController.ClientCommitMapChange
// [0xFFFF0000010209C2] 
struct AOLPlayerController_eventClientCommitMapChange_Params
{
};

// Function OLGame.OLPlayerController.StartNewGameAtCheckpoint
// [0x00420400] 
struct AOLPlayerController_execStartNewGameAtCheckpoint_Params
{
	class FString                                      CheckpointStr;                                    		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bSaveToDisk : 1;                                  		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.ApplyCheckpointRecord
// [0x00420002] 
struct AOLPlayerController_execApplyCheckpointRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x00D4) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.GetSaveGameNameFromRecord
// [0x00420002] 
struct AOLPlayerController_execGetSaveGameNameFromRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x00D4) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      SaveGameName;                                     		// 0x00D4 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.CreateCheckpointRecord
// [0x00420002] 
struct AOLPlayerController_execCreateCheckpointRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x00D4) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.SetSaveGameName
// [0x00020400] 
struct AOLPlayerController_execSetSaveGameName_Params
{
	class FString                                      SaveGameName;                                     		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.GetSaveGameName
// [0x00420400] 
struct AOLPlayerController_execGetSaveGameName_Params
{
	class FString                                      SaveGameName;                                     		// 0x0000 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.NativeGetSaveGameNameFromRecord
// [0x00420400] 
struct AOLPlayerController_execNativeGetSaveGameNameFromRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x00D4) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      SaveGameName;                                     		// 0x00D4 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.NativeApplyCheckpointRecord
// [0x00420400] 
struct AOLPlayerController_execNativeApplyCheckpointRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x00D4) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.NativeGetCurrentCheckpointRecord
// [0x00420400] 
struct AOLPlayerController_execNativeGetCurrentCheckpointRecord_Params
{
	struct AOLPlayerController_FCheckpointRecord       Record;                                           		// 0x0000 (0x00D4) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.StopAllSounds
// [0x00020400] 
struct AOLPlayerController_execStopAllSounds_Params
{
};

// Function OLGame.OLPlayerController.DrawHUD
// [0x00020002] 
struct AOLPlayerController_execDrawHUD_Params
{
	class AHUD*                                        H;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AOLHUD*                                      OLHUD;                                            		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.FullScreenOverlayChanged
// [0x00020802] 
struct AOLPlayerController_eventFullScreenOverlayChanged_Params
{
};

// Function OLGame.OLPlayerController.ForcePause
// [0x00020802] 
struct AOLPlayerController_eventForcePause_Params
{
	uint32_t                                           bPause : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.ClientSetHUD
// [0xFFFF0000010201C2] 
struct AOLPlayerController_execClientSetHUD_Params
{
	class UClass*                                      newHUDType;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.OnSetMesh
// [0x00020802] 
struct AOLPlayerController_eventOnSetMesh_Params
{
	class USeqAct_SetMesh*                             Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.ClientSetCameraFade
// [0xFFFF0000010249C2] 
struct AOLPlayerController_eventClientSetCameraFade_Params
{
	uint32_t                                           _enableFading : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	struct FColor                                      _FadeColor;                                       		// 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FVector2D                                   _FadeAlpha;                                       		// 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              _FadeTime;                                        		// 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           _fadeAudio : 1;                                   		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function OLGame.OLPlayerController.SetCinematicMode
// [0x00020002] 
struct AOLPlayerController_execSetCinematicMode_Params
{
	class USeqAct_ToggleCinematicMode*                 Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bInCinematicMode : 1;                             		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bHidePlayer : 1;                                  		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bAffectsHUD : 1;                                  		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bAffectsMovement : 1;                             		// 0x0014 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bAffectsTurning : 1;                              		// 0x0018 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bAffectsButtons : 1;                              		// 0x001C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.GetPlayerViewPoint
// [0x00420902] 
struct AOLPlayerController_eventGetPlayerViewPoint_Params
{
	struct FVector                                     POVLocation;                                      		// 0x0000 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    POVRotation;                                      		// 0x000C (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function OLGame.OLPlayerController.GetFOVAngle
// [0x00820802] 
struct AOLPlayerController_eventGetFOVAngle_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class ACameraActor*                                CamActor;                                         		// 0x0004 (0x0008) [0x0000000000000000]               
	// struct FVector                                     DummyPOVLocation;                                 		// 0x000C (0x000C) [0x0000000000000000]               
	// struct FRotator                                    DummyPOVRotation;                                 		// 0x0018 (0x000C) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.SpawnCamera
// [0x00020002] 
struct AOLPlayerController_execSpawnCamera_Params
{
	// class AActor*                                      OldViewTarget;                                    		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLPlayerController.SetCameraMode
// [0x00020002] 
struct AOLPlayerController_execSetCameraMode_Params
{
	struct FName                                       NewCamMode;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.UsingFirstPersonCamera
// [0x00020002] 
struct AOLPlayerController_execUsingFirstPersonCamera_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.SetBehindView
// [0x00020002] 
struct AOLPlayerController_execSetBehindView_Params
{
	uint32_t                                           bNewBehindView : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.BehindView
// [0x00020202] 
struct AOLPlayerController_execBehindView_Params
{
};

// Function OLGame.OLPlayerController.NotifyProfileChanged
// [0x00020400] 
struct AOLPlayerController_execNotifyProfileChanged_Params
{
};

// Function OLGame.OLPlayerController.CleanTextFilterButtonInput
// [0x00020400] 
struct AOLPlayerController_execCleanTextFilterButtonInput_Params
{
	struct FName                                       ButtonName;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.IsLookInputIgnored
// [0x00020802] 
struct AOLPlayerController_eventIsLookInputIgnored_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.ToggleCrawl
// [0x00020202] 
struct AOLPlayerController_execToggleCrawl_Params
{
};

// Function OLGame.OLPlayerController.PrototypeActionE
// [0x00020202] 
struct AOLPlayerController_execPrototypeActionE_Params
{
};

// Function OLGame.OLPlayerController.PrototypeActionD
// [0x00020202] 
struct AOLPlayerController_execPrototypeActionD_Params
{
};

// Function OLGame.OLPlayerController.PrototypeActionC
// [0x00020202] 
struct AOLPlayerController_execPrototypeActionC_Params
{
};

// Function OLGame.OLPlayerController.PrototypeActionB
// [0x00020202] 
struct AOLPlayerController_execPrototypeActionB_Params
{
};

// Function OLGame.OLPlayerController.PrototypeActionA
// [0x00020202] 
struct AOLPlayerController_execPrototypeActionA_Params
{
};

// Function OLGame.OLPlayerController.GammaCalibration
// [0x00020202] 
struct AOLPlayerController_execGammaCalibration_Params
{
};

// Function OLGame.OLPlayerController.ToggleInventory
// [0x00020202] 
struct AOLPlayerController_execToggleInventory_Params
{
};

// Function OLGame.OLPlayerController.ToggleMicrophone
// [0x00020202] 
struct AOLPlayerController_execToggleMicrophone_Params
{
};

// Function OLGame.OLPlayerController.ToggleRun
// [0x00020202] 
struct AOLPlayerController_execToggleRun_Params
{
};

// Function OLGame.OLPlayerController.PressedJump
// [0x00020202] 
struct AOLPlayerController_execPressedJump_Params
{
};

// Function OLGame.OLPlayerController.PressedUseBandage
// [0x00020202] 
struct AOLPlayerController_execPressedUseBandage_Params
{
};

// Function OLGame.OLPlayerController.ReleasedReloadBatteries
// [0x00020202] 
struct AOLPlayerController_execReleasedReloadBatteries_Params
{
};

// Function OLGame.OLPlayerController.PressedReloadBatteries
// [0x00020202] 
struct AOLPlayerController_execPressedReloadBatteries_Params
{
};

// Function OLGame.OLPlayerController.StopZoom
// [0x00020302] 
struct AOLPlayerController_execStopZoom_Params
{
};

// Function OLGame.OLPlayerController.StartZoomOut
// [0x00020302] 
struct AOLPlayerController_execStartZoomOut_Params
{
};

// Function OLGame.OLPlayerController.StartZoomIn
// [0x00020302] 
struct AOLPlayerController_execStartZoomIn_Params
{
};

// Function OLGame.OLPlayerController.ZoomOut
// [0x00020202] 
struct AOLPlayerController_execZoomOut_Params
{
};

// Function OLGame.OLPlayerController.ZoomIn
// [0x00020202] 
struct AOLPlayerController_execZoomIn_Params
{
};

// Function OLGame.OLPlayerController.ToggleCamcorder
// [0x00020202] 
struct AOLPlayerController_execToggleCamcorder_Params
{
};

// Function OLGame.OLPlayerController.ToggleNightVision
// [0x00020202] 
struct AOLPlayerController_execToggleNightVision_Params
{
};

// Function OLGame.OLPlayerController.ReleasedUseButton
// [0x00020202] 
struct AOLPlayerController_execReleasedUseButton_Params
{
};

// Function OLGame.OLPlayerController.PressedUseButton
// [0x00020202] 
struct AOLPlayerController_execPressedUseButton_Params
{
};

// Function OLGame.OLPlayerController.PerformedUseAction
// [0x00020102] 
struct AOLPlayerController_execPerformedUseAction_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.ResetWorldNoCheckpoint
// [0x00020400] 
struct AOLPlayerController_execResetWorldNoCheckpoint_Params
{
};

// Function OLGame.OLPlayerController.Destroyed
// [0x00020802] 
struct AOLPlayerController_eventDestroyed_Params
{
};

// Function OLGame.OLPlayerController.ClientRestart
// [0xFFFF0000010201C2] 
struct AOLPlayerController_execClientRestart_Params
{
	class APawn*                                       NewPawn;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.Reset
// [0x00020002] 
struct AOLPlayerController_execReset_Params
{
};

// Function OLGame.OLPlayerController.UnPossess
// [0x00020802] 
struct AOLPlayerController_eventUnPossess_Params
{
};

// Function OLGame.OLPlayerController.Possess
// [0x00020802] 
struct AOLPlayerController_eventPossess_Params
{
	class APawn*                                       inPawn;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bVehicleTransition : 1;                           		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLPlayerController.PostBeginPlay
// [0x00020902] 
struct AOLPlayerController_eventPostBeginPlay_Params
{
};

// Function OLGame.OLPlayerController.ShowRecordingTime
// [0x00020400] 
struct AOLPlayerController_execShowRecordingTime_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.GetGraphicAPIString
// [0x00020400] 
struct AOLPlayerController_execGetGraphicAPIString_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function OLGame.OLPlayerController.ShowGraphicAPIString
// [0x00020400] 
struct AOLPlayerController_execShowGraphicAPIString_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.HideLoadingOverlay
// [0x00020400] 
struct AOLPlayerController_execHideLoadingOverlay_Params
{
};

// Function OLGame.OLPlayerController.ShowLoadingOverlay
// [0x00020400] 
struct AOLPlayerController_execShowLoadingOverlay_Params
{
};

// Function OLGame.OLPlayerController.SetVolume
// [0x00020400] 
struct AOLPlayerController_execSetVolume_Params
{
	float                                              VolumeLevel;                                      		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.ApplyKeyBindings
// [0x00020400] 
struct AOLPlayerController_execApplyKeyBindings_Params
{
	class UOLProfileSettings*                          UserConfiguredSettings;                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.SetGamma
// [0x00020400] 
struct AOLPlayerController_execSetGamma_Params
{
	float                                              GammaValue;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLPlayerController.GetGamma
// [0x00020400] 
struct AOLPlayerController_execGetGamma_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLPlayerController.NativePlayerMove
// [0x00020400] 
struct AOLPlayerController_execNativePlayerMove_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCheatManager.ToggleFakeLongSubtitles
// [0x00020202] 
struct UOLCheatManager_execToggleFakeLongSubtitles_Params
{
};

// Function OLGame.OLCheatManager.ToggleFakeRecordingReadFailure
// [0x00020202] 
struct UOLCheatManager_execToggleFakeRecordingReadFailure_Params
{
};

// Function OLGame.OLCheatManager.ToggleFakeRecordingWriteFailure
// [0x00020202] 
struct UOLCheatManager_execToggleFakeRecordingWriteFailure_Params
{
};

// Function OLGame.OLCheatManager.ClearAllDingoRecordings
// [0x00020600] 
struct UOLCheatManager_execClearAllDingoRecordings_Params
{
};

// Function OLGame.OLCheatManager.FakeDingoRecordingRight
// [0x00020600] 
struct UOLCheatManager_execFakeDingoRecordingRight_Params
{
};

// Function OLGame.OLCheatManager.DingoTest
// [0x00020600] 
struct UOLCheatManager_execDingoTest_Params
{
};

// Function OLGame.OLCheatManager.ResetTutorialReminderTimers
// [0x00020600] 
struct UOLCheatManager_execResetTutorialReminderTimers_Params
{
};

// Function OLGame.OLCheatManager.IsFakeNotFullyDownloaded
// [0x00020600] 
struct UOLCheatManager_execIsFakeNotFullyDownloaded_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function OLGame.OLCheatManager.ToggleGameFullyDownloaded
// [0x00020600] 
struct UOLCheatManager_execToggleGameFullyDownloaded_Params
{
};

// Function OLGame.OLCheatManager.TriggerNotDownloadScreen
// [0x00020600] 
struct UOLCheatManager_execTriggerNotDownloadScreen_Params
{
};

// Function OLGame.OLCheatManager.FakeControllerDisconnected
// [0x00020600] 
struct UOLCheatManager_execFakeControllerDisconnected_Params
{
	uint32_t                                           bDelayedPause : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function OLGame.OLCheatManager.ForceHandsCrucifixion
// [0x00020600] 
struct UOLCheatManager_execForceHandsCrucifixion_Params
{
};

// Function OLGame.OLCheatManager.DecrementDifficultyModeModifier
// [0x00020600] 
struct UOLCheatManager_execDecrementDifficultyModeModifier_Params
{
};

// Function OLGame.OLCheatManager.IncrementDifficultyModeModifier
// [0x00020600] 
struct UOLCheatManager_execIncrementDifficultyModeModifier_Params
{
};

// Function OLGame.OLCheatManager.DecrementDifficultyMode
// [0x00020600] 
struct UOLCheatManager_execDecrementDifficultyMode_Params
{
};

// Function OLGame.OLCheatManager.IncrementDifficultyMode
// [0x00020600] 
struct UOLCheatManager_execIncrementDifficultyMode_Params
{
};

// Function OLGame.OLCheatManager.ToggleCharacterPhysicDebug
// [0x00020202] 
struct UOLCheatManager_execToggleCharacterPhysicDebug_Params
{
};

// Function OLGame.OLCheatManager.TryGeneratePath
// [0x00824202] 
struct UOLCheatManager_execTryGeneratePath_Params
{
	float                                              PosX;                                             		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PosY;                                             		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PosZ;                                             		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bTight : 1;                                       		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              BufferDist;                                       		// 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	// uint32_t                                           bResult : 1;                                      		// 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                     DestPos;                                          		// 0x0018 (0x000C) [0x0000000000000000]               
};

// Function OLGame.OLCheatManager.SetAIVerbosity
// [0x00020600] 
struct UOLCheatManager_execSetAIVerbosity_Params
{
	int32_t                                            NewVerbosity;                                     		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function OLGame.OLCheatManager.KillSelectedEnemy
// [0x00020202] 
struct UOLCheatManager_execKillSelectedEnemy_Params
{
	// class APawn*                                       P;                                                		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCheatManager.KillAllEnemiesButSelected
// [0x00020202] 
struct UOLCheatManager_execKillAllEnemiesButSelected_Params
{
	// class APawn*                                       P;                                                		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCheatManager.KillAllEnemies
// [0x00020202] 
struct UOLCheatManager_execKillAllEnemies_Params
{
	// class APawn*                                       P;                                                		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function OLGame.OLCheatManager.CleanupAfterKillAll
// [0x00020400] 
struct UOLCheatManager_execCleanupAfterKillAll_Params
{
};

// Function OLGame.OLCheatManager.SetLanguage
// [0x00020600] 
struct UOLCheatManager_execSetLanguage_Params
{
